cw3/cw3.org
#+title: Laboratorium 3 - Problem ograniczonego bufora
#+date: 28.10.2024r.
#+author: Piotr Karamon
#+setupfile: ../setupfile.org
#+latex_header: \usepackage[a4paper, total={6in, 8in}]{geometry}


* Treści zadań
** Zadanie 1
Problem ograniczonego bufora (producentów-konsumentów). Dany jest bufor, do
którego producent może wkładać dane, a konsument pobierać. Napisać program,
który zorganizuje takie działanie producenta i konsumenta, w którym zapewniona
będzie własność bezpieczeństwa i żywotności.

Zrealizować program:

1. przy pomocy metod =wait()/notify()=. Kod szkieletu
   a. dla przypadku 1 producent/1 konsument
   b. dla przypadku $n_1$ producentów/n2 konsumentów ($n_1>n_2$, $n_1=n_2$, $n_1<n_2$)
   c. wprowadzić wywołanie metody =sleep()= i wykonać pomiary, obserwując zachowanie producentów/konsumentów
2. przy pomocy operacji =P()/V()= dla semafora:
   a. $n_1=n_2=1$
   b. $n_1>1$, $n_2>1$

** Zadanie 2
Przetwarzanie potokowe z buforem
+ Bufor o rozmiarze N - wspólny dla wszystkich procesów!
+ Proces A będący producentem.
+ Proces Z będący konsumentem.
+ Procesy B, C, ..., Y będące procesami przetwarzającymi. Kaidy proces otrzymuje dana wejściowa od procesu poprzedniego, jego wyjście zaś jest konsumowane przez proces następny.
+ Procesy przetwarzają dane w miejscu, po czym przechodzą do kolejnej komórki bufora i znowu przetwarzają ja w miejscu.
+ Procesy działają z rożnymi prędkościami.
Uwaga:

1. W implementacji nie jest dozwolone korzystanie/implementowanie własnych
   kolejek FIFO, należy używać tylko mechanizmu monitorów lub semaforów !
2. Zaimplementować rozwiązanie przetwarzania potokowego (Przykładowe założenia:
   bufor rozmiaru 100, 1 producent, 1 konsument, 5 uszeregowanych procesów
   przetwarzających.) Od czego zależy prędkość obróbki w tym systemie ?
   Rozwiązanie za pomocą semaforów lub monitorów (dowolnie). Zrobić sprawozdanie
   z przetwarzania potokowego.

* Zadanie 1
