cw3/cw3.org
** Rozwiązanie przy użyciu =wait= i =notify=
Rozwiązanie wykorzystuje mechanizm monitorów do synchronizacji producentów i
konsumentów, współdzielących ograniczony bufor. W metodzie =put= producent dodaje
element, ale czeka (=wait()=), gdy bufor jest pełny. Metoda =get= pozwala
konsumentowi pobrać element, czekając, gdy bufor jest pusty. Po każdej operacji
=put= lub =get= wywołanie =notifyAll()= budzi inne wątki, zapewniając płynność
działania producentów i konsumentów.

Kod klasy =BufferUsingMonitor=
#+begin_src java
class BufferUsingMonitor {
    private final int capacity;
    private final LinkedList<Integer> buffer = new LinkedList<>();

    public BufferUsingMonitor(int capacity) {
        this.capacity = capacity;
    }

    public synchronized void put(int i) {
        while (buffer.size() >= capacity) {
            try {
                wait();
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }
        buffer.add(i);
        notifyAll();
    }

    public synchronized int get() {
        while (buffer.isEmpty()) {
            try {
                wait();
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }
        int element = buffer.removeFirst();
        notifyAll();
        return element;

    }

    public int size() {
        return buffer.size();
    }
}
#+end_src

Kod producenta oraz konsumenta jest bardzo prosty. Dostają oni bufor oraz
liczbę iteracji które mają wykonać.

#+begin_src java
class Producer extends Thread {
    private final BufferUsingSemaphores buffer;
    private final int numberOfIterations;

    public Producer(BufferUsingSemaphores buffer, int numberOfIterations) {
        this.buffer = buffer;
        this.numberOfIterations = numberOfIterations;
    }


    public void run() {
        for (int i = 0; i < numberOfIterations; ++i) {
            buffer.put(i);
        }
    }
}

class Consumer extends Thread {
    private final BufferUsingSemaphores buffer;
    private final int numberOfIterations;

    public Consumer(BufferUsingSemaphores buffer, int numberOfIterations) {
        this.buffer = buffer;
        this.numberOfIterations = numberOfIterations;
    }

    public void run() {
        for (int i = 0; i < numberOfIterations; ++i) {
            System.out.println(buffer.get());
        }
    }
}
#+end_src


W celu łatwego testowania rożnych wariantów wprowadzamy metodę =run()=, która
przyjmuję liczbę producentów oraz konsumentów i wykonuje eksperyment.
Pojemność bufora jest stała i wynosi 10.

#+begin_src java
public static void run(int producers, int consumers) {
    int products = producers * 20;
    int producersIterations = products / producers;
    int consumersIterations = products / consumers;

    System.out.printf(
        "Producers = %s, Consumers = %s, Total Products = %s %n", producers, consumers, products);
    System.out.printf(
        "One producers produces = %s items, One consumer consumes = %s items%n",
         producersIterations, consumersIterations);


    BufferUsingMonitor buffer = new BufferUsingMonitor(10);
    List<? extends Thread> threads = Stream.concat(
        IntStream.range(0, producers).mapToObj(i -> new Producer(buffer, producersIterations)),
        IntStream.range(0, consumers).mapToObj(i -> new Consumer(buffer, consumersIterations)))
       .toList();

    threads.forEach(Thread::start);
    try {
        for (Thread t : threads) {
            t.join();
        }
    } catch (InterruptedException e) {
        e.printStackTrace();
    }

    System.out.println("All done");
    System.out.println("Buffer size: " + buffer.size());
    System.out.println();
}
#+end_src

W metodzie =main= testujemy nasz program dla różnych ilości producentów i konsumentów.
#+begin_src java
public static void main(String[] args) {
    run(1, 1);
    run(5, 2);
    run(2, 5);
    run(5, 5);
}
#+end_src

Wynik działania programu:

#+begin_example
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 items
All done
Buffer size: 0

Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 items
All done
Buffer size: 0

Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 items
All done
Buffer size: 0

Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 items
All done
Buffer size: 0
#+end_example

Wszystkie wątki poprawnie się zakończyły, nie nastąpiło zakleszczenie, ani
wyścig, wszystkie elementy bufora zostały skonsumowane. Program zatem działa
poprawnie.

Dodajemy teraz wywołania metody =sleep()= oraz =println()= w celu obserwacji i pomiaru
czasu działania programu.
Wywołania =println()= są umieszczone w metodach bufora.
Natomiast wywołania =sleep()= są umieszczone w każdej iteracji producenta i konsumenta.
Wątki śpią po 20ms.

Wynik wykonania zmodyfikowanego programu(z racji bardzo dużej ilości linii
tylko
pierwsze są pokazane w celu ukazania tendencji):

#+begin_example
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 items
Produced: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
Produced: 3
Consumed: 3
Produced: 4
Consumed: 4
Produced: 5
Consumed: 5
Produced: 6
Consumed: 6
Produced: 7
Consumed: 7
Produced: 8
Consumed: 8
Produced: 9
Consumed: 9
Produced: 10
Consumed: 10
Produced: 11
Consumed: 11
Produced: 12
Consumed: 12
Produced: 13
Consumed: 13
Produced: 14
Consumed: 14
Produced: 15
Consumed: 15
Produced: 16
Consumed: 16
Produced: 17
Consumed: 17
Produced: 18
Consumed: 18
Produced: 19
Consumed: 19
All done
Buffer size: 0
#+end_example

#+begin_example
Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 items
Produced: 0
Produced: 0
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 0
Produced: 1
Produced: 1
Produced: 1
Consumed: 0
Produced: 1
Consumed: 0
Produced: 1
Produced: 2
Produced: 2
Produced: 2
Consumed: 0
Produced: 2
Consumed: 1
Produced: 2
Produced: 3
Consumed: 1
...
All done
Buffer size: 0
#+end_example

#+begin_example
Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 items
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
Produced: 3
Consumed: 3
Produced: 2
Consumed: 2
Produced: 4
Consumed: 4
Produced: 3
Consumed: 3
Produced: 5
Consumed: 5
Produced: 4
Consumed: 4
Produced: 6
...
All done
Buffer size: 0
#+end_example

#+begin_example
Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 items
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 0
Produced: 0
Produced: 0
Consumed: 0
Consumed: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
...
All done
Buffer size: 0
#+end_example

Jak widzimy program nadal działa poprawnie.
Pomiędzy wykonaniem konsumentów oraz producentów
następuje naturalny przeplot we wszystkich przypadkach.
Konsumenci pobierają dane z bufora chwilę, po włożeniu ich
przez producentów.


W celu analizy czasowej naszego programu skorzystamy z funkcji =runTimed()=
pobiera ona liczbę produktów do przetworzenia ,ilość producentów, konsumentów
oraz czas opóźnienia, osobny dla producentów i konsumentów.
\newpage

#+begin_src java
public static void runTimed(
        int products,
        int producers,
        int producersDelay,
        int consumers,
        int consumersDelay) {
    int producersIterations = products / producers;
    int consumersIterations = products / consumers;

    System.out.println("Products = " + products);
    System.out.printf("Producers = %s, Consumers = %s, Total Products = %s %n", producers, consumers, products);
    System.out.printf("One producers produces = %s items, One consumer consumes = %s item%n",
            producersIterations, consumersIterations);

    BufferUsingMonitor buffer = new BufferUsingMonitor(10);
    List<? extends Thread> threads = Stream.concat(
                    IntStream
                            .range(0, producers)
                            .mapToObj(i -> new Producer(producersDelay, buffer, producersIterations)),
                    IntStream
                            .range(0, consumers)
                            .mapToObj(i -> new Consumer(consumersDelay, buffer, consumersIterations)))
            .toList();

    long startTime = System.currentTimeMillis();

    threads.forEach(Thread::start);
    try {
        for (Thread t : threads) {
            t.join();
        }
    } catch (InterruptedException e) {
        e.printStackTrace();
    }

    long endTime = System.currentTimeMillis();
    System.out.println("Time taken: " + (endTime - startTime) + "ms");
    System.out.println();
}
#+end_src

Uruchamiamy funkcję dla następujących przypadków:
#+begin_src java
int delay = 3;

System.out.println("Producer is as fast as consumer");

runTimed(1000, 1, delay, 1, delay);
runTimed(1000, 5, delay, 2, delay);
runTimed(1000, 2, delay, 5, delay);
runTimed(1000, 5, delay, 5, delay);

System.out.println("Producer is 3x slower than consumer");

runTimed(1000, 1, delay * 3, 1, delay);
runTimed(1000, 5, delay * 3, 2, delay);
runTimed(1000, 2, delay * 3, 5, delay);
runTimed(1000, 5, delay * 3, 5, delay);
#+end_src


Wynik programu:
#+begin_example
Producer is as fast as consumer
Products = 1000
Producers = 1, Consumers = 1, Total Products = 1000
One producers produces = 1000 items, One consumer consumes = 1000 item
Time taken: 3619ms

Products = 1000
Producers = 5, Consumers = 2, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 500 item
Time taken: 1891ms

Products = 1000
Producers = 2, Consumers = 5, Total Products = 1000
One producers produces = 500 items, One consumer consumes = 200 item
Time taken: 1859ms

Products = 1000
Producers = 5, Consumers = 5, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 200 item
Time taken: 801ms
#+end_example

#+begin_example
Producer is 3x slower than consumer
Products = 1000
Producers = 1, Consumers = 1, Total Products = 1000
One producers produces = 1000 items, One consumer consumes = 1000 item
Time taken: 9646ms

Products = 1000
Producers = 5, Consumers = 2, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 500 item
Time taken: 1957ms

Products = 1000
Producers = 2, Consumers = 5, Total Products = 1000
One producers produces = 500 items, One consumer consumes = 200 item
Time taken: 4813ms

Products = 1000
Producers = 5, Consumers = 5, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 200 item
Time taken: 1927ms
#+end_example

W przypadku gdy producent oraz konsument pracują jednym tempem widzimy:
+ 1 producent oraz 1 konsument potrzebują 3619ms by przetworzyć dane
+ 2 producentów oraz 5 konsumentów potrzebują 1859ms by przetworzyć dane,
   jest to bardzo bliskie $\frac{3619}{2}$, pomimo tego że mamy do dyspozycji aż 7 wątków,
   to przyśpieszenie jest zaledwie podwójne.
+ W przypadku 5 producentów oraz 2 konsumentów mamy prawie identyczne wyniki jak
   wyżej.
+ Przyśpieszenie bliskie 5x uzyskujemy dopiero w przypadku 5 producentów oraz 5 konsumentów.
+ Oznacza to, że ilość producentów oraz konsumentów powinna być starannie dobrana, bo w
   przeciwnym wypadku, niektóre wątki stają się tak naprawdę nadmiarowe.
   Zamiast 5 producentów i 2 konsumentów moglibyśmy użyć 2 producentów w celu uzyskania
   tej samej prędkości.

W przypadku gdy producent jest 3x wolniejszy niż konsument:
+ W poprzednim przypadku czas dla  przypadków 5/2 i 2/5 był identyczny.
   W tym natomiast widać bardzo znaczną różnicę. Czas produkcji jest o wiele wyższy od
   czasu konsumpcji, co oznacza, że potrzebujemy więcej producentów w celu
   zapewnienia szybkości systemu.


*Wnioski*:
System z wykorzystaniem metod =wait()= i =notify()= skutecznie synchronizuje
producentów i konsumentów, umożliwiając bezpieczny dostęp do bufora bez ryzyka
zakleszczeń czy wyścigów. Mechanizm monitorów pozwala producentom i konsumentom
czekać na odpowiednie warunki (np. dostępność miejsca lub danych w buforze), co
gwarantuje, że wszystkie elementy zostaną prawidłowo przetworzone. Wyniki
eksperymentów pokazały, że wydajność systemu zależy od odpowiedniego doboru
liczby producentów i konsumentów – zbyt duża lub zbyt mała liczba wątków może
prowadzić do nadmiarowości lub niedostatecznego wykorzystania zasobów, co wpływa
na szybkość przetwarzania danych w systemie.
