cw03/cw3.tex
\section*{Zadanie 1}
\label{sec:org3463791}
\subsection*{Rozwiązanie przy użyciu \texttt{wait} i \texttt{notify}}
\label{sec:orgd6cce55}
Rozwiązanie wykorzystuje mechanizm monitorów do synchronizacji producentów i
konsumentów, współdzielących ograniczony bufor. W metodzie \texttt{put} producent dodaje
element, ale czeka (\texttt{wait()}), gdy bufor jest pełny. Metoda \texttt{get} pozwala
konsumentowi pobrać element, czekając, gdy bufor jest pusty. Po każdej operacji
\texttt{put} lub \texttt{get} wywołanie \texttt{notifyAll()} budzi inne wątki, zapewniając płynność
działania producentów i konsumentów.

Kod klasy \texttt{BufferUsingMonitor}
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{BufferUsingMonitor} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{int} \EFv{capacity};
    \EFk{private} \EFk{final} \EFt{LinkedList}\EFrdb{<}\EFt{Integer}\EFrdb{>} \EFv{buffer} = \EFk{new} \EFt{LinkedList}\EFrdb{<}\EFrdb{>}\EFrdb{(}\EFrdb{)};

    \EFk{public} BufferUsingMonitor\EFrdb{(}\EFt{int} \EFv{capacity}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.capacity = capacity;
    \EFrdb{\}}

    \EFk{public} \EFk{synchronized} \EFt{void} \EFf{put}\EFrdb{(}\EFt{int} \EFv{i}\EFrdb{)} \EFrdb{\{}
        \EFk{while} \EFrdc{(}buffer.size\EFrdd{(}\EFrdd{)} >= capacity\EFrdc{)} \EFrdc{\{}
            \EFk{try} \EFrdd{\{}
                wait\EFrda{(}\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
        \EFrdc{\}}
        buffer.add\EFrdc{(}i\EFrdc{)};
        notifyAll\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    \EFk{public} \EFk{synchronized} \EFt{int} \EFf{get}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{while} \EFrdc{(}buffer.isEmpty\EFrdd{(}\EFrdd{)}\EFrdc{)} \EFrdc{\{}
            \EFk{try} \EFrdd{\{}
                wait\EFrda{(}\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
        \EFrdc{\}}
        \EFt{int} \EFv{element} = buffer.removeFirst\EFrdc{(}\EFrdc{)};
        notifyAll\EFrdc{(}\EFrdc{)};
        \EFk{return} element;

    \EFrdb{\}}

    \EFk{public} \EFt{int} \EFf{size}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{return} buffer.size\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Kod producenta oraz konsumenta jest bardzo prosty. Dostają oni bufor oraz
liczbę iteracji które mają wykonać.

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Producer} \EFk{extends} \EFt{Thread} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{BufferUsingSemaphores} \EFv{buffer};
    \EFk{private} \EFk{final} \EFt{int} \EFv{numberOfIterations};

    \EFk{public} Producer\EFrdb{(}\EFt{BufferUsingSemaphores} \EFv{buffer}, \EFt{int} \EFv{numberOfIterations}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.buffer = buffer;
        \EFk{this}.numberOfIterations = numberOfIterations;
    \EFrdb{\}}


    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFt{numberOfIterations}; ++i\EFrdc{)} \EFrdc{\{}
            buffer.put\EFrdd{(}i\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}

\EFk{class} \EFt{Consumer} \EFk{extends} \EFt{Thread} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{BufferUsingSemaphores} \EFv{buffer};
    \EFk{private} \EFk{final} \EFt{int} \EFv{numberOfIterations};

    \EFk{public} Consumer\EFrdb{(}\EFt{BufferUsingSemaphores} \EFv{buffer}, \EFt{int} \EFv{numberOfIterations}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.buffer = buffer;
        \EFk{this}.numberOfIterations = numberOfIterations;
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFt{numberOfIterations}; ++i\EFrdc{)} \EFrdc{\{}
            System.out.println\EFrdd{(}buffer.get\EFrda{(}\EFrda{)}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}


W celu łatwego testowania rożnych wariantów wprowadzamy metodę \texttt{run()}, która
przyjmuję liczbę producentów oraz konsumentów i wykonuje eksperyment.
Pojemność bufora jest stała i wynosi 10.

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{run}\EFrda{(}\EFt{int} \EFv{producers}, \EFt{int} \EFv{consumers}\EFrda{)} \EFrda{\{}
    \EFt{int} \EFv{products} = producers * \EFhn{20};
    \EFt{int} \EFv{producersIterations} = products / producers;
    \EFt{int} \EFv{consumersIterations} = products / consumers;

    System.out.printf\EFrdb{(}
        \EFs{"Producers = \%s, Consumers = \%s, Total Products = \%s \%n"}, producers, consumers, products\EFrdb{)};
    System.out.printf\EFrdb{(}
        \EFs{"One producers produces = \%s items, One consumer consumes = \%s items\%n"},
         producersIterations, consumersIterations\EFrdb{)};


    \EFt{BufferUsingMonitor} \EFv{buffer} = \EFk{new} \EFt{BufferUsingMonitor}\EFrdb{(}\EFhn{10}\EFrdb{)};
    \EFt{List}\EFrdb{<}? \EFk{extends} \EFt{Thread}\EFrdb{>} \EFv{threads} = Stream.concat\EFrdb{(}
        IntStream.range\EFrdc{(}\EFhn{0}, producers\EFrdc{)}.mapToObj\EFrdc{(}i -> \EFk{new} \EFt{Producer}\EFrdd{(}buffer, producersIterations\EFrdd{)}\EFrdc{)},
        IntStream.range\EFrdc{(}\EFhn{0}, consumers\EFrdc{)}.mapToObj\EFrdc{(}i -> \EFk{new} \EFt{Consumer}\EFrdd{(}buffer, consumersIterations\EFrdd{)}\EFrdc{)}\EFrdb{)}
       .toList\EFrdb{(}\EFrdb{)};

    threads.forEach\EFrdb{(}Thread::start\EFrdb{)};
    \EFk{try} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{Thread} \EFv{t} : threads\EFrdc{)} \EFrdc{\{}
            t.join\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}} \EFk{catch} \EFrdb{(}InterruptedException e\EFrdb{)} \EFrdb{\{}
        e.printStackTrace\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    System.out.println\EFrdb{(}\EFs{"All done"}\EFrdb{)};
    System.out.println\EFrdb{(}\EFs{"Buffer size: "} + buffer.size\EFrdc{(}\EFrdc{)}\EFrdb{)};
    System.out.println\EFrdb{(}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

W metodzie \texttt{main} testujemy nasz program dla różnych ilości producentów i konsumentów.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{main}\EFrda{(}\EFt{String}\EFrdb{[}\EFrdb{]} \EFv{args}\EFrda{)} \EFrda{\{}
    run\EFrdb{(}\EFhn{1}, \EFhn{1}\EFrdb{)};
    run\EFrdb{(}\EFhn{5}, \EFhn{2}\EFrdb{)};
    run\EFrdb{(}\EFhn{2}, \EFhn{5}\EFrdb{)};
    run\EFrdb{(}\EFhn{5}, \EFhn{5}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Wynik działania programu:

\begin{tcolorbox}
\begin{Verbatim}
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 items
All done
Buffer size: 0

Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 items
All done
Buffer size: 0

Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 items
All done
Buffer size: 0

Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 items
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}Wszystkie wątki poprawnie się zakończyły, nie nastąpiło zakleszczenie, ani
wyścig, wszystkie elementy bufora zostały skonsumowane. Program zatem działa
poprawnie.

Dodajemy teraz wywołania metody \texttt{sleep()} oraz \texttt{println()} w celu obserwacji i pomiaru
czasu działania programu.
Wywołania \texttt{println()} są umieszczone w metodach bufora.
Natomiast wywołania \texttt{sleep()} są umieszczone w każdej iteracji producenta i konsumenta.
Wątki śpią po 20ms.

Wynik wykonania zmodyfikowanego programu(z racji bardzo dużej ilości linii
tylko
pierwsze są pokazane w celu ukazania tendencji):

\begin{tcolorbox}
\begin{Verbatim}
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 items
Produced: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
Produced: 3
Consumed: 3
Produced: 4
Consumed: 4
Produced: 5
Consumed: 5
Produced: 6
Consumed: 6
Produced: 7
Consumed: 7
Produced: 8
Consumed: 8
Produced: 9
Consumed: 9
Produced: 10
Consumed: 10
Produced: 11
Consumed: 11
Produced: 12
Consumed: 12
Produced: 13
Consumed: 13
Produced: 14
Consumed: 14
Produced: 15
Consumed: 15
Produced: 16
Consumed: 16
Produced: 17
Consumed: 17
Produced: 18
Consumed: 18
Produced: 19
Consumed: 19
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}\begin{tcolorbox}
\begin{Verbatim}
Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 items
Produced: 0
Produced: 0
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 0
Produced: 1
Produced: 1
Produced: 1
Consumed: 0
Produced: 1
Consumed: 0
Produced: 1
Produced: 2
Produced: 2
Produced: 2
Consumed: 0
Produced: 2
Consumed: 1
Produced: 2
Produced: 3
Consumed: 1
...
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}\begin{tcolorbox}
\begin{Verbatim}
Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 items
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
Produced: 3
Consumed: 3
Produced: 2
Consumed: 2
Produced: 4
Consumed: 4
Produced: 3
Consumed: 3
Produced: 5
Consumed: 5
Produced: 4
Consumed: 4
Produced: 6
...
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}\begin{tcolorbox}
\begin{Verbatim}
Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 items
Produced: 0
Consumed: 0
Produced: 0
Consumed: 0
Produced: 0
Produced: 0
Produced: 0
Consumed: 0
Consumed: 0
Consumed: 0
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 1
Consumed: 1
Produced: 2
Consumed: 2
...
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}Jak widzimy program nadal działa poprawnie.
Pomiędzy wykonaniem konsumentów oraz producentów
następuje naturalny przeplot we wszystkich przypadkach.
Konsumenci pobierają dane z bufora chwilę, po włożeniu ich
przez producentów.


W celu analizy czasowej naszego programu skorzystamy z funkcji \texttt{runTimed()}
pobiera ona liczbę produktów do przetworzenia ,ilość producentów, konsumentów
oraz czas opóźnienia, osobny dla producentów i konsumentów.
\newpage

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{runTimed}\EFrda{(}
        \EFt{int} \EFv{products},
        \EFt{int} \EFv{producers},
        \EFt{int} \EFv{producersDelay},
        \EFt{int} \EFv{consumers},
        \EFt{int} \EFv{consumersDelay}\EFrda{)} \EFrda{\{}
    \EFt{int} \EFv{producersIterations} = products / producers;
    \EFt{int} \EFv{consumersIterations} = products / consumers;

    System.out.println\EFrdb{(}\EFs{"Products = "} + products\EFrdb{)};
    System.out.printf\EFrdb{(}\EFs{"Producers = \%s, Consumers = \%s, Total Products = \%s \%n"}, producers, consumers, products\EFrdb{)};
    System.out.printf\EFrdb{(}\EFs{"One producers produces = \%s items, One consumer consumes = \%s item\%n"},
            producersIterations, consumersIterations\EFrdb{)};

    \EFt{BufferUsingMonitor} \EFv{buffer} = \EFk{new} \EFt{BufferUsingMonitor}\EFrdb{(}\EFhn{10}\EFrdb{)};
    \EFt{List}\EFrdb{<}? \EFk{extends} \EFt{Thread}\EFrdb{>} \EFv{threads} = Stream.concat\EFrdb{(}
                    IntStream
                            .range\EFrdc{(}\EFhn{0}, producers\EFrdc{)}
                            .mapToObj\EFrdc{(}i -> \EFk{new} \EFt{Producer}\EFrdd{(}producersDelay, buffer, producersIterations\EFrdd{)}\EFrdc{)},
                    IntStream
                            .range\EFrdc{(}\EFhn{0}, consumers\EFrdc{)}
                            .mapToObj\EFrdc{(}i -> \EFk{new} \EFt{Consumer}\EFrdd{(}consumersDelay, buffer, consumersIterations\EFrdd{)}\EFrdc{)}\EFrdb{)}
            .toList\EFrdb{(}\EFrdb{)};

    \EFt{long} \EFv{startTime} = System.currentTimeMillis\EFrdb{(}\EFrdb{)};

    threads.forEach\EFrdb{(}Thread::start\EFrdb{)};
    \EFk{try} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{Thread} \EFv{t} : threads\EFrdc{)} \EFrdc{\{}
            t.join\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}} \EFk{catch} \EFrdb{(}InterruptedException e\EFrdb{)} \EFrdb{\{}
        e.printStackTrace\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    \EFt{long} \EFv{endTime} = System.currentTimeMillis\EFrdb{(}\EFrdb{)};
    System.out.println\EFrdb{(}\EFs{"Time taken: "} + \EFrdc{(}endTime - startTime\EFrdc{)} + \EFs{"ms"}\EFrdb{)};
    System.out.println\EFrdb{(}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Uruchamiamy funkcję dla następujących przypadków:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFt{int} \EFv{delay} = \EFhn{3};

System.out.println\EFrda{(}\EFs{"Producer is as fast as consumer"}\EFrda{)};

runTimed\EFrda{(}\EFhn{1000}, \EFhn{1}, delay, \EFhn{1}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{5}, delay, \EFhn{2}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{2}, delay, \EFhn{5}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{5}, delay, \EFhn{5}, delay\EFrda{)};

System.out.println\EFrda{(}\EFs{"Producer is 3x slower than consumer"}\EFrda{)};

runTimed\EFrda{(}\EFhn{1000}, \EFhn{1}, delay * \EFhn{3}, \EFhn{1}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{5}, delay * \EFhn{3}, \EFhn{2}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{2}, delay * \EFhn{3}, \EFhn{5}, delay\EFrda{)};
runTimed\EFrda{(}\EFhn{1000}, \EFhn{5}, delay * \EFhn{3}, \EFhn{5}, delay\EFrda{)};
\end{Verbatim}
\end{Code}


Wynik programu:
\begin{tcolorbox}
\begin{Verbatim}
Producer is as fast as consumer
Products = 1000
Producers = 1, Consumers = 1, Total Products = 1000
One producers produces = 1000 items, One consumer consumes = 1000 item
Time taken: 3619ms

Products = 1000
Producers = 5, Consumers = 2, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 500 item
Time taken: 1891ms

Products = 1000
Producers = 2, Consumers = 5, Total Products = 1000
One producers produces = 500 items, One consumer consumes = 200 item
Time taken: 1859ms

Products = 1000
Producers = 5, Consumers = 5, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 200 item
Time taken: 801ms
\end{Verbatim}


\end{tcolorbox}\begin{tcolorbox}
\begin{Verbatim}
Producer is 3x slower than consumer
Products = 1000
Producers = 1, Consumers = 1, Total Products = 1000
One producers produces = 1000 items, One consumer consumes = 1000 item
Time taken: 9646ms

Products = 1000
Producers = 5, Consumers = 2, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 500 item
Time taken: 1957ms

Products = 1000
Producers = 2, Consumers = 5, Total Products = 1000
One producers produces = 500 items, One consumer consumes = 200 item
Time taken: 4813ms

Products = 1000
Producers = 5, Consumers = 5, Total Products = 1000
One producers produces = 200 items, One consumer consumes = 200 item
Time taken: 1927ms
\end{Verbatim}


\end{tcolorbox}W przypadku gdy producent oraz konsument pracują jednym tempem widzimy:
\begin{itemize}
\item 1 producent oraz 1 konsument potrzebują 3619ms by przetworzyć dane
\item 2 producentów oraz 5 konsumentów potrzebują 1859ms by przetworzyć dane,
jest to bardzo bliskie \(\frac{3619}{2}\), pomimo tego że mamy do dyspozycji aż 7 wątków,
to przyśpieszenie jest zaledwie podwójne.
\item W przypadku 5 producentów oraz 2 konsumentów mamy prawie identyczne wyniki jak
wyżej.
\item Przyśpieszenie bliskie 5x uzyskujemy dopiero w przypadku 5 producentów oraz 5 konsumentów.
\item Oznacza to, że ilość producentów oraz konsumentów powinna być starannie dobrana, bo w
przeciwnym wypadku, niektóre wątki stają się tak naprawdę nadmiarowe.
Zamiast 5 producentów i 2 konsumentów moglibyśmy użyć 2 producentów w celu uzyskania
tej samej prędkości.
\end{itemize}

W przypadku gdy producent jest 3x wolniejszy niż konsument:
\begin{itemize}
\item W poprzednim przypadku czas dla  przypadków 5/2 i 2/5 był identyczny.
W tym natomiast widać bardzo znaczną różnicę. Czas produkcji jest o wiele wyższy od
czasu konsumpcji, co oznacza, że potrzebujemy więcej producentów w celu
zapewnienia szybkości systemu.
\end{itemize}


\textbf{Wnioski}:
System z wykorzystaniem metod \texttt{wait()} i \texttt{notify()} skutecznie synchronizuje
producentów i konsumentów, umożliwiając bezpieczny dostęp do bufora bez ryzyka
zakleszczeń czy wyścigów. Mechanizm monitorów pozwala producentom i konsumentom
czekać na odpowiednie warunki (np. dostępność miejsca lub danych w buforze), co
gwarantuje, że wszystkie elementy zostaną prawidłowo przetworzone. Wyniki
eksperymentów pokazały, że wydajność systemu zależy od odpowiedniego doboru
liczby producentów i konsumentów – zbyt duża lub zbyt mała liczba wątków może
prowadzić do nadmiarowości lub niedostatecznego wykorzystania zasobów, co wpływa
na szybkość przetwarzania danych w systemie.
