cw3/cw3.org
** Rozwiązanie przy użyciu semaforów
W celu synchronizacji używamy trzech semaforów. Semafor =mutex= zapewnia wyłączny
dostęp do bufora, podczas gdy semafory zliczające =empty= i =full= kontrolują
dostępne miejsca i liczbę elementów w buforze. Metoda =put(int i)= blokuje
producenta, gdy bufor jest pełny, uzyskuje dostęp do bufora, dodaje element i
zwiększa semafor =full=. Z kolei metoda =get()= czeka na dostępność elementów, usuwa
je z bufora i zwiększa semafor =empty=.

Rozwiązanie implementuje w klasie =BufforUsingSemaphores=

#+begin_src java
class BufferUsingSemaphores {
    private final int capacity;
    private final LinkedList<Integer> buffer = new LinkedList<>();
    private final BinarySemaphore mutex = new BinarySemaphore();
    private final CountingSemaphore empty;
    private final CountingSemaphore full;

    public BufferUsingSemaphores(int capacity) {
        this.capacity = capacity;
        empty = new CountingSemaphore(capacity);
        full = new CountingSemaphore(0);
    }

    public void put(int i) {
        empty.P();
        mutex.P();

        buffer.add(i);

        mutex.V();
        full.V();

    }

    public int get() {
        full.P();
        mutex.P();

        int result = buffer.removeFirst();

        mutex.V();
        empty.V();
        return result;
    }

    public int size() {
        return buffer.size();
    }
}
#+end_src

Zmieniamy klasy =Producer= i =Consumer= tak by korzystały właśnie z tego bufora.
Testujemy nasz bufor dokładnie dla tych samych przypadków co poprzednio.

Wynik:
#+begin_example
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 item
All done
Buffer size: 0

Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 item
All done
Buffer size: 0

Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 item
All done
Buffer size: 0

Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 item
All done
Buffer size: 0
#+end_example

Jak widać zachowanie programu jest poprawne po wymianie implementacji bufora.

*Wnioski*: Do synchronizacji producentów i
konsumentów można użyć: metod  =wait()= i =notify()= oraz semaforów. Oba mechanizmy
umożliwiają bezpieczny, zsynchronizowany dostęp do współdzielonego bufora,
eliminując zakleszczenia i wyścigi.
