cw03/cw3.tex
\subsection*{Rozwiązanie przy użyciu semaforów}
\label{sec:org4ec23ad}
W celu synchronizacji używamy trzech semaforów. Semafor \texttt{mutex} zapewnia wyłączny
dostęp do bufora, podczas gdy semafory zliczające \texttt{empty} i \texttt{full} kontrolują
dostępne miejsca i liczbę elementów w buforze. Metoda \texttt{put(int i)} blokuje
producenta, gdy bufor jest pełny, uzyskuje dostęp do bufora, dodaje element i
zwiększa semafor \texttt{full}. Z kolei metoda \texttt{get()} czeka na dostępność elementów, usuwa
je z bufora i zwiększa semafor \texttt{empty}.

Rozwiązanie implementuje w klasie \texttt{BufforUsingSemaphores}

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{BufferUsingSemaphores} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{int} \EFv{capacity};
    \EFk{private} \EFk{final} \EFt{LinkedList}\EFrdb{<}\EFt{Integer}\EFrdb{>} \EFv{buffer} = \EFk{new} \EFt{LinkedList}\EFrdb{<}\EFrdb{>}\EFrdb{(}\EFrdb{)};
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{mutex} = \EFk{new} \EFt{BinarySemaphore}\EFrdb{(}\EFrdb{)};
    \EFk{private} \EFk{final} \EFt{CountingSemaphore} \EFv{empty};
    \EFk{private} \EFk{final} \EFt{CountingSemaphore} \EFv{full};

    \EFk{public} BufferUsingSemaphores\EFrdb{(}\EFt{int} \EFv{capacity}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.capacity = capacity;
        empty = \EFk{new} \EFt{CountingSemaphore}\EFrdc{(}capacity\EFrdc{)};
        full = \EFk{new} \EFt{CountingSemaphore}\EFrdc{(}\EFhn{0}\EFrdc{)};
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{put}\EFrdb{(}\EFt{int} \EFv{i}\EFrdb{)} \EFrdb{\{}
        \EFo{empty}.P\EFrdc{(}\EFrdc{)};
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};

        buffer.add\EFrdc{(}i\EFrdc{)};

        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
        \EFo{full}.V\EFrdc{(}\EFrdc{)};

    \EFrdb{\}}

    \EFk{public} \EFt{int} \EFf{get}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFo{full}.P\EFrdc{(}\EFrdc{)};
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};

        \EFt{int} \EFv{result} = buffer.removeFirst\EFrdc{(}\EFrdc{)};

        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
        \EFo{empty}.V\EFrdc{(}\EFrdc{)};
        \EFk{return} result;
    \EFrdb{\}}

    \EFk{public} \EFt{int} \EFf{size}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{return} buffer.size\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Zmieniamy klasy \texttt{Producer} i \texttt{Consumer} tak by korzystały właśnie z tego bufora.
Testujemy nasz bufor dokładnie dla tych samych przypadków co poprzednio.

Wynik:
\begin{tcolorbox}
\begin{Verbatim}
Producers = 1, Consumers = 1, Total Products = 20
One producers produces = 20 items, One consumer consumes = 20 item
All done
Buffer size: 0

Producers = 5, Consumers = 2, Total Products = 100
One producers produces = 20 items, One consumer consumes = 50 item
All done
Buffer size: 0

Producers = 2, Consumers = 5, Total Products = 40
One producers produces = 20 items, One consumer consumes = 8 item
All done
Buffer size: 0

Producers = 5, Consumers = 5, Total Products = 100
One producers produces = 20 items, One consumer consumes = 20 item
All done
Buffer size: 0
\end{Verbatim}


\end{tcolorbox}Jak widać zachowanie programu jest poprawne po wymianie implementacji bufora.

\textbf{Wnioski}: Do synchronizacji producentów i
konsumentów można użyć: metod  \texttt{wait()} i \texttt{notify()} oraz semaforów. Oba mechanizmy
umożliwiają bezpieczny, zsynchronizowany dostęp do współdzielonego bufora,
eliminując zakleszczenia i wyścigi.
