cw3/cw3.org
* Zadanie 2
Przedstawiony problem jest rozwinięciem problemu producentów-konsumentów.
Po szybkiej analizie problemu można dojść do następujących wniosków:

+ Chcemy by producent mógł wpisywać dane do bufora, dopóki są w nim wolne
   miejsca. Producenta nie obchodzą wątki przetwarzające, jedynie interesuję
   go ile jest wolnych miejsc w buforze. Po wpisaniu do bufora powinien
   w jakiś sposób powiadomić wątki przetwarzające o nowym elemencie.
+ Gdy producent wpiszę do bufora jeden element, to wtedy ciąg operacji
   dla niego jest jasno określony. Wątki przetwarzające będą po kolei
   przetwarzać element i zapisywać nową wartość w komórce.
   To oznacza, że wątki przetwarzające nie powinny wymagać
   posiadania mutexa na cały bufor, bo byłoby to po prostu mało efektywne.
   Zamiast tego powinny przekazywać sobie możliwość modyfikacji elementu.
+ Wątek przetwarzający po transformacji jednego elementu nie powinien czekać
   na całkowite przetworzenie tego elementu, powinien on móc przejść do elementu
   następnego.

Idea rozwiązania:
+ =empty= jest semaforem licznikowym i zlicza on ilość wolnych miejsc,
   jest opuszczany przez producenta, a podnoszony przez konsumenta
+ =mutex= jest semaforem binarnym, który jest używany przez producenta
   oraz konsumenta by nie nastąpił wyścig przy zmienianiu rozmiaru bufora
   (zmiana znaczników =head= i =tail=).
+ =transformersIndexes= przechowuje informacje o tym który element
   powinien zostać przetworzony przez odpowiadający wątek przetwarzający.
+ Każdy wątek przetwarzający oraz konsument mają odpowiadający semafor licznikowy.
   Semafory początkowo mają wartość zero.
   Producent gdy dodaje element podnosi semafor pierwszego wątku przetwarzającego.
   To pozwala wątkowi przetwarzającemu na dokonanie transformacji na jednym elemencie.
   Gdy tego dokona podnoszony jest semafor kolejnego wątku w potoku.
+ Na końcu potoku dane zbiera konsument, podnosząc semafor =empty= informuje producenta
   o zwolnionym miejscu. Konsument w przedstawionym rozwiązaniu
   tworzy listę zebranych elementów weryfikacji wyniku.

Kod bufora:
#+begin_src java
class Buffer {
    private final int capacity;
    private final BinarySemaphore mutex;
    private final CountingSemaphore empty;
    private final List<CountingSemaphore> transformers;
    private final int[] transformersIndexes;

    private final int[] buffer;
    private int bufferHead = 0;
    private int bufferTail = 0;

    public Buffer(int capacity, int transformersCount) {
        this.capacity = capacity;
        buffer = new int[capacity];
        mutex = new BinarySemaphore();
        empty = new CountingSemaphore(capacity);
        transformers = IntStream
            .range(0, transformersCount + 1)
            .mapToObj(i -> new CountingSemaphore(0))
            .toList();
        transformersIndexes = new int[transformersCount];
    }

    public void add(int x) {
        empty.P();
        mutex.P();

        buffer[bufferHead] = x;
        bufferHead = (bufferHead + 1) % capacity;

        mutex.V();
        transformers.getFirst().V();
    }

    public void transform(int transformerIndex, Function<Integer, Integer> transformation) {
        transformers.get(transformerIndex).P();

        int elementIndex = transformersIndexes[transformerIndex];
        buffer[elementIndex] = transformation.apply(buffer[elementIndex]);
        transformersIndexes[transformerIndex] = (elementIndex + 1) % capacity;

        transformers.get(transformerIndex + 1).V();
    }

    public int get() {
        transformers.getLast().P();
        mutex.P();

        int result = buffer[bufferTail];
        bufferTail = (bufferTail + 1) % capacity;

        mutex.V();
        empty.V();
        return result;
    }
}
#+end_src

Kod producenta:
#+begin_src java
class Producer implements Runnable {
    private final Buffer buffer;

    public Producer(Buffer buffer) {
        this.buffer = buffer;
    }

    @Override
    public void run() {
        for (int i = 0; i < 500 i++) {
            try {
                Thread.sleep(10);
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
            buffer.add(i);
        }
    }
}
#+end_src

Kod wątków przetwarzających:
#+begin_src java
class Transformer implements Runnable {
    private final Buffer buffer;
    private final Function<Integer, Integer> transformation;
    private final int transformerIndex;
    private final int delayMs;

    public Transformer(
            int transformerIndex,
            Buffer buffer,
            Function<Integer, Integer> transformation,
            int delayMs) {
        this.buffer = buffer;
        this.transformerIndex = transformerIndex;
        this.transformation = transformation;
        this.delayMs = delayMs;
    }

    @Override
    public void run() {
        for (int i = 0; i < 500; i++) {
            try {
                Thread.sleep(delayMs);
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
            buffer.transform(transformerIndex, transformation);
        }
    }
}
#+end_src

Kod konsumenta:
#+begin_src java
class Consumer implements Runnable {
    public final List<Integer> results = new ArrayList<>();
    private final Buffer buffer;

    public Consumer(Buffer buffer) {
        this.buffer = buffer;
    }

    @Override
    public void run() {
        for (int i = 0; i < 500; i++) {
            try {
                Thread.sleep(15);
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
            int result = buffer.get();
            results.add(result);
        }
    }
}
#+end_src

Kod testujący:
#+begin_src java
Buffer buffer = new Buffer(100, 5);

var producer = new Producer(buffer);
var transformer1 = new Transformer(0, buffer, x -> x + 1, 3);
var transformer2 = new Transformer(1, buffer, x -> x * 2, 3);
var transformer3 = new Transformer(2, buffer, x -> x * 3, 1);
var transformer4 = new Transformer(3, buffer, x -> x - 100, 10);
var transformer5 = new Transformer(4, buffer, x -> x + 10_000, 5);
var consumer = new Consumer(buffer);

List<Integer> expectedResults = IntStream.range(0, 500).map(
        x -> (x + 1) * 2 * 3 - 100 + 10_000
).boxed().toList();

var threads = Stream.of(
        producer,
        transformer1,
        transformer2,
        transformer3,
        transformer4,
        transformer5,
        consumer
).map(Thread::new).toList();

threads.forEach(Thread::start);
try {
    for (Thread thread : threads) {
        thread.join();
    }
} catch (InterruptedException e) {
    e.printStackTrace();
}


System.out.println("All done");
System.out.println("Results are equal: " + consumer.results.equals(expectedResults));
#+end_src

Wynik:
#+begin_example
All done
Results are equal: true
#+end_example

Stworzone współbieżne rozwiązanie przetwarzania potokowego z buforem dało
identyczny wynik co rozwiązanie sekwencyjne.

Prędkość obróki w takim systemie zależy od najwolniejszego wątku w potoku.
Jeden wątek w potoku może całkowicie zmienić prędkość naszego systemu,
bo kolejne procesy muszą czekać na zakończenie jego prac. Wynika to z faktu, że
operacje przetwarzające dla danego elementu muszą się wykonywać sekwencyjnie.

*Wnioski*: Dzięki zastosowaniu semaforów, możliwe jest przetwarzanie potokowe z
ograniczonym buforem. Stworzony program pozwala na łatwą zmianę struktury
potoku(ilości wątków przetwarzających oraz ich funkcje). Szybkość takiego
systemu jest mocno ograniczona z racji, tego że wiele operacji musi być
wykonanych w bardzo określonej kolejności.


