cw03/cw3.tex
\section*{Zadanie 2}
\label{sec:orgcc2a4ae}
Przedstawiony problem jest rozwinięciem problemu producentów-konsumentów.
Po szybkiej analizie problemu można dojść do następujących wniosków:

\begin{itemize}
\item Chcemy by producent mógł wpisywać dane do bufora, dopóki są w nim wolne
miejsca. Producenta nie obchodzą wątki przetwarzające, jedynie interesuję
go ile jest wolnych miejsc w buforze. Po wpisaniu do bufora powinien
w jakiś sposób powiadomić wątki przetwarzające o nowym elemencie.
\item Gdy producent wpiszę do bufora jeden element, to wtedy ciąg operacji
dla niego jest jasno określony. Wątki przetwarzające będą po kolei
przetwarzać element i zapisywać nową wartość w komórce.
To oznacza, że wątki przetwarzające nie powinny wymagać
posiadania mutexa na cały bufor, bo byłoby to po prostu mało efektywne.
Zamiast tego powinny przekazywać sobie możliwość modyfikacji elementu.
\item Wątek przetwarzający po transformacji jednego elementu nie powinien czekać
na całkowite przetworzenie tego elementu, powinien on móc przejść do elementu
następnego.
\end{itemize}

Idea rozwiązania:
\begin{itemize}
\item \texttt{empty} jest semaforem licznikowym i zlicza on ilość wolnych miejsc,
jest opuszczany przez producenta, a podnoszony przez konsumenta
\item \texttt{mutex} jest semaforem binarnym, który jest używany przez producenta
oraz konsumenta by nie nastąpił wyścig przy zmienianiu rozmiaru bufora
(zmiana znaczników \texttt{head} i \texttt{tail}).
\item \texttt{transformersIndexes} przechowuje informacje o tym który element
powinien zostać przetworzony przez odpowiadający wątek przetwarzający.
\item Każdy wątek przetwarzający oraz konsument mają odpowiadający semafor licznikowy.
Semafory początkowo mają wartość zero.
Producent gdy dodaje element podnosi semafor pierwszego wątku przetwarzającego.
To pozwala wątkowi przetwarzającemu na dokonanie transformacji na jednym elemencie.
Gdy tego dokona podnoszony jest semafor kolejnego wątku w potoku.
\item Na końcu potoku dane zbiera konsument, podnosząc semafor \texttt{empty} informuje producenta
o zwolnionym miejscu. Konsument w przedstawionym rozwiązaniu
tworzy listę zebranych elementów weryfikacji wyniku.
\end{itemize}

Kod bufora:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Buffer} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{int} \EFv{capacity};
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{mutex};
    \EFk{private} \EFk{final} \EFt{CountingSemaphore} \EFv{empty};
    \EFk{private} \EFk{final} \EFt{List}\EFrdb{<}\EFt{CountingSemaphore}\EFrdb{>} \EFv{transformers};
    \EFk{private} \EFk{final} \EFt{int}\EFrdb{[}\EFrdb{]} \EFv{transformersIndexes};

    \EFk{private} \EFk{final} \EFt{int}\EFrdb{[}\EFrdb{]} \EFv{buffer};
    \EFk{private} \EFt{int} \EFv{bufferHead} = \EFhn{0};
    \EFk{private} \EFt{int} \EFv{bufferTail} = \EFhn{0};

    \EFk{public} Buffer\EFrdb{(}\EFt{int} \EFv{capacity}, \EFt{int} \EFv{transformersCount}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.capacity = capacity;
        buffer = \EFk{new} \EFt{int}\EFrdc{[}capacity\EFrdc{]};
        mutex = \EFk{new} \EFt{BinarySemaphore}\EFrdc{(}\EFrdc{)};
        empty = \EFk{new} \EFt{CountingSemaphore}\EFrdc{(}capacity\EFrdc{)};
        transformers = IntStream
            .range\EFrdc{(}\EFhn{0}, transformersCount + \EFhn{1}\EFrdc{)}
            .mapToObj\EFrdc{(}i -> \EFk{new} \EFt{CountingSemaphore}\EFrdd{(}\EFhn{0}\EFrdd{)}\EFrdc{)}
            .toList\EFrdc{(}\EFrdc{)};
        transformersIndexes = \EFk{new} \EFt{int}\EFrdc{[}transformersCount\EFrdc{]};
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{add}\EFrdb{(}\EFt{int} \EFv{x}\EFrdb{)} \EFrdb{\{}
        \EFo{empty}.P\EFrdc{(}\EFrdc{)};
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};

        buffer\EFrdc{[}bufferHead\EFrdc{]} = x;
        bufferHead = \EFrdc{(}bufferHead + \EFhn{1}\EFrdc{)} \% capacity;

        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
        transformers.getFirst\EFrdc{(}\EFrdc{)}.V\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{transform}\EFrdb{(}\EFt{int} \EFv{transformerIndex}, \EFt{Function}\EFrdc{<}\EFt{Integer}, \EFt{Integer}\EFrdc{>} \EFv{transformation}\EFrdb{)} \EFrdb{\{}
        transformers.get\EFrdc{(}transformerIndex\EFrdc{)}.P\EFrdc{(}\EFrdc{)};

        \EFt{int} \EFv{elementIndex} = transformersIndexes\EFrdc{[}transformerIndex\EFrdc{]};
        buffer\EFrdc{[}elementIndex\EFrdc{]} = transformation.apply\EFrdc{(}buffer\EFrdd{[}elementIndex\EFrdd{]}\EFrdc{)};
        transformersIndexes\EFrdc{[}transformerIndex\EFrdc{]} = \EFrdc{(}elementIndex + \EFhn{1}\EFrdc{)} \% capacity;

        transformers.get\EFrdc{(}transformerIndex + \EFhn{1}\EFrdc{)}.V\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    \EFk{public} \EFt{int} \EFf{get}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        transformers.getLast\EFrdc{(}\EFrdc{)}.P\EFrdc{(}\EFrdc{)};
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};

        \EFt{int} \EFv{result} = buffer\EFrdc{[}bufferTail\EFrdc{]};
        bufferTail = \EFrdc{(}bufferTail + \EFhn{1}\EFrdc{)} \% capacity;

        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
        \EFo{empty}.V\EFrdc{(}\EFrdc{)};
        \EFk{return} result;
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Kod producenta:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Producer} \EFk{implements} \EFt{Runnable} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{Buffer} \EFv{buffer};

    \EFk{public} Producer\EFrdb{(}Buffer buffer\EFrdb{)} \EFrdb{\{}
        \EFk{this}.buffer = buffer;
    \EFrdb{\}}

    \textcolor[HTML]{0000b0}{@Override}
    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFhn{500} i++\EFrdc{)} \EFrdc{\{}
            \EFk{try} \EFrdd{\{}
                Thread.sleep\EFrda{(}\EFhn{10}\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
            buffer.add\EFrdd{(}i\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Kod wątków przetwarzających:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Transformer} \EFk{implements} \EFt{Runnable} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{Buffer} \EFv{buffer};
    \EFk{private} \EFk{final} \EFt{Function}\EFrdb{<}\EFt{Integer}, \EFt{Integer}\EFrdb{>} \EFv{transformation};
    \EFk{private} \EFk{final} \EFt{int} \EFv{transformerIndex};
    \EFk{private} \EFk{final} \EFt{int} \EFv{delayMs};

    \EFk{public} Transformer\EFrdb{(}
            \EFt{int} \EFv{transformerIndex},
            \EFt{Buffer} \EFv{buffer},
            Function<\EFt{Integer}, Integer> transformation,
            \EFt{int} \EFv{delayMs}\EFrdb{)} \EFrdb{\{}
        \EFk{this}.buffer = buffer;
        \EFk{this}.transformerIndex = transformerIndex;
        \EFk{this}.transformation = transformation;
        \EFk{this}.delayMs = delayMs;
    \EFrdb{\}}

    \textcolor[HTML]{0000b0}{@Override}
    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFhn{500}; i++\EFrdc{)} \EFrdc{\{}
            \EFk{try} \EFrdd{\{}
                Thread.sleep\EFrda{(}delayMs\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
            buffer.transform\EFrdd{(}transformerIndex, transformation\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Kod konsumenta:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{Consumer} \EFk{implements} \EFt{Runnable} \EFrda{\{}
    \EFk{public} \EFk{final} \EFt{List}\EFrdb{<}\EFt{Integer}\EFrdb{>} \EFv{results} = \EFk{new} \EFt{ArrayList}\EFrdb{<}\EFrdb{>}\EFrdb{(}\EFrdb{)};
    \EFk{private} \EFk{final} \EFt{Buffer} \EFv{buffer};

    \EFk{public} Consumer\EFrdb{(}Buffer buffer\EFrdb{)} \EFrdb{\{}
        \EFk{this}.buffer = buffer;
    \EFrdb{\}}

    \textcolor[HTML]{0000b0}{@Override}
    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFhn{500}; i++\EFrdc{)} \EFrdc{\{}
            \EFk{try} \EFrdd{\{}
                Thread.sleep\EFrda{(}\EFhn{15}\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
            \EFt{int} \EFv{result} = buffer.get\EFrdd{(}\EFrdd{)};
            results.add\EFrdd{(}result\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Kod testujący:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFt{Buffer} \EFv{buffer} = \EFk{new} \EFt{Buffer}\EFrda{(}\EFhn{100}, \EFhn{5}\EFrda{)};

\EFt{var} \EFv{producer} = \EFk{new} \EFt{Producer}\EFrda{(}buffer\EFrda{)};
\EFt{var} \EFv{transformer1} = \EFk{new} \EFt{Transformer}\EFrda{(}\EFhn{0}, buffer, x -> x + \EFhn{1}, \EFhn{3}\EFrda{)};
\EFt{var} \EFv{transformer2} = \EFk{new} \EFt{Transformer}\EFrda{(}\EFhn{1}, buffer, x -> x * \EFhn{2}, \EFhn{3}\EFrda{)};
\EFt{var} \EFv{transformer3} = \EFk{new} \EFt{Transformer}\EFrda{(}\EFhn{2}, buffer, x -> x * \EFhn{3}, \EFhn{1}\EFrda{)};
\EFt{var} \EFv{transformer4} = \EFk{new} \EFt{Transformer}\EFrda{(}\EFhn{3}, buffer, x -> x - \EFhn{100}, \EFhn{10}\EFrda{)};
\EFt{var} \EFv{transformer5} = \EFk{new} \EFt{Transformer}\EFrda{(}\EFhn{4}, buffer, x -> x + 10\_000, \EFhn{5}\EFrda{)};
\EFt{var} \EFv{consumer} = \EFk{new} \EFt{Consumer}\EFrda{(}buffer\EFrda{)};

\EFt{List}\EFrda{<}\EFt{Integer}\EFrda{>} \EFv{expectedResults} = IntStream.range\EFrda{(}\EFhn{0}, \EFhn{500}\EFrda{)}.map\EFrda{(}
        x -> \EFrdb{(}x + \EFhn{1}\EFrdb{)} * \EFhn{2} * \EFhn{3} - \EFhn{100} + 10\_000
\EFrda{)}.boxed\EFrda{(}\EFrda{)}.toList\EFrda{(}\EFrda{)};

\EFt{var} \EFv{threads} = Stream.of\EFrda{(}
        producer,
        transformer1,
        transformer2,
        transformer3,
        transformer4,
        transformer5,
        consumer
\EFrda{)}.map\EFrda{(}Thread::\EFk{new}\EFrda{)}.toList\EFrda{(}\EFrda{)};

threads.forEach\EFrda{(}Thread::start\EFrda{)};
\EFk{try} \EFrda{\{}
    \EFk{for} \EFrdb{(}\EFt{Thread} \EFv{thread} : threads\EFrdb{)} \EFrdb{\{}
        thread.join\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}} \EFk{catch} \EFrda{(}InterruptedException e\EFrda{)} \EFrda{\{}
    e.printStackTrace\EFrdb{(}\EFrdb{)};
\EFrda{\}}


System.out.println\EFrda{(}\EFs{"All done"}\EFrda{)};
System.out.println\EFrda{(}\EFs{"Results are equal: "} + consumer.results.equals\EFrdb{(}expectedResults\EFrdb{)}\EFrda{)};
\end{Verbatim}
\end{Code}

Wynik:
\begin{tcolorbox}
\begin{Verbatim}
All done
Results are equal: true
\end{Verbatim}


\end{tcolorbox}Stworzone współbieżne rozwiązanie przetwarzania potokowego z buforem dało
identyczny wynik co rozwiązanie sekwencyjne.

Prędkość obróki w takim systemie zależy od najwolniejszego wątku w potoku.
Jeden wątek w potoku może całkowicie zmienić prędkość naszego systemu,
bo kolejne procesy muszą czekać na zakończenie jego prac. Wynika to z faktu, że
operacje przetwarzające dla danego elementu muszą się wykonywać sekwencyjnie.

\textbf{Wnioski}: Dzięki zastosowaniu semaforów, możliwe jest przetwarzanie potokowe z
ograniczonym buforem. Stworzony program pozwala na łatwą zmianę struktury
potoku(ilości wątków przetwarzających oraz ich funkcje). Szybkość takiego
systemu jest mocno ograniczona z racji, tego że wiele operacji musi być
wykonanych w bardzo określonej kolejności.
