cw03/cw3.tex
\section*{Bibliografia}
\label{sec:org1cc1d38}
\begin{itemize}
\item Bill Venners: \emph{Inside the Java Virtual Machine Chapter 20}
\end{itemize}
\end{document}
